In [3]:
import pandas as pd

In [44]:
#Loading data into notebook from 

data = pd.read_csv('/Users/lauracrowell/Documents/advent day 1 - 1.txt', sep=" ", header=None)
print(data.head())
data.columns

       0   1   2      3
0  37033 NaN NaN  48086
1  80098 NaN NaN  34930
2  88073 NaN NaN  69183
3  54342 NaN NaN  63061
4  98409 NaN NaN  87908

Int64Index([0, 1, 2, 3], dtype='int64')

In [47]:
#Removing columns 1, 2 as they aren't needed/loaded arbitrarily

df = data.drop(data.columns[[1,2]], axis=1)
df.head()

       0      3
0  37033  48086
1  80098  34930
2  88073  69183
3  54342  63061
4  98409  87908

In [52]:
#Renaming column headers for readability 

df.columns = ['Group 1', 'Group 2']
df.head()

   Group 1  Group 2
0    37033    48086
1    80098    34930
2    88073    69183
3    54342    63061
4    98409    87908

In [112]:
#Creating lists out of df columns for indexing

left = df['Group 1'].to_list()
right = df['Group 2'].to_list()

#Sorting lists from smallest to largest values
left.sort()
right.sort()

left[0:3]
right[0:3]

both = list(zip(left,right))
both_list = [list(i) for i in both]
both_list[0:3]

[[10204, 10033], [10218, 10062], [10355, 10345]]

In [109]:
#Finding difference between concatenated list values
difference = [abs(i-j) for i,j in both_list]
difference[0:3]

[171, 156, 10]

In [111]:
#Sum of differences
def totals(lists):
    total = 0
    for i in lists:
        total +=i
    return total

totals(difference)

1223326